grevaillot/svd_tools/headers/ATSAMR21E19A/tcc0.h
#pragma once 

/* --- TCC0: Timer Counter Control 0 -------------------------------- */

/** @defgroup tcc0_registers Timer Counter Control 0 Register
@{*/

/** TCC0_CTRLA Control A **/
#define TCC0_CTRLA			MMIO32(TCC0_BASE + 0x00)
/** TCC0_CTRLBCLR Control B Clear **/
#define TCC0_CTRLBCLR			MMIO32(TCC0_BASE + 0x04)
/** TCC0_CTRLBSET Control B Set **/
#define TCC0_CTRLBSET			MMIO32(TCC0_BASE + 0x05)
/** TCC0_SYNCBUSY Synchronization Busy **/
#define TCC0_SYNCBUSY			MMIO32(TCC0_BASE + 0x08)
/** TCC0_FCTRLA Recoverable Fault A Configuration **/
#define TCC0_FCTRLA			MMIO32(TCC0_BASE + 0x0c)
/** TCC0_FCTRLB Recoverable Fault B Configuration **/
#define TCC0_FCTRLB			MMIO32(TCC0_BASE + 0x10)
/** TCC0_WEXCTRL Waveform Extension Configuration **/
#define TCC0_WEXCTRL			MMIO32(TCC0_BASE + 0x14)
/** TCC0_DRVCTRL Driver Control **/
#define TCC0_DRVCTRL			MMIO32(TCC0_BASE + 0x18)
/** TCC0_DBGCTRL Debug Control **/
#define TCC0_DBGCTRL			MMIO32(TCC0_BASE + 0x1e)
/** TCC0_EVCTRL Event Control **/
#define TCC0_EVCTRL			MMIO32(TCC0_BASE + 0x20)
/** TCC0_INTENCLR Interrupt Enable Clear **/
#define TCC0_INTENCLR			MMIO32(TCC0_BASE + 0x24)
/** TCC0_INTENSET Interrupt Enable Set **/
#define TCC0_INTENSET			MMIO32(TCC0_BASE + 0x28)
/** TCC0_INTFLAG Interrupt Flag Status and Clear **/
#define TCC0_INTFLAG			MMIO32(TCC0_BASE + 0x2c)
/** TCC0_STATUS Status **/
#define TCC0_STATUS			MMIO32(TCC0_BASE + 0x30)
/** TCC0_COUNT Count **/
#define TCC0_COUNT			MMIO32(TCC0_BASE + 0x34)
/** TCC0_COUNT_DITH4 Count **/
#define TCC0_COUNT_DITH4			MMIO32(TCC0_BASE + 0x34)
/** TCC0_COUNT_DITH5 Count **/
#define TCC0_COUNT_DITH5			MMIO32(TCC0_BASE + 0x34)
/** TCC0_COUNT_DITH6 Count **/
#define TCC0_COUNT_DITH6			MMIO32(TCC0_BASE + 0x34)
/** TCC0_PATT Pattern **/
#define TCC0_PATT			MMIO32(TCC0_BASE + 0x38)
/** TCC0_WAVE Waveform Control **/
#define TCC0_WAVE			MMIO32(TCC0_BASE + 0x3c)
/** TCC0_PER Period **/
#define TCC0_PER			MMIO32(TCC0_BASE + 0x40)
/** TCC0_PER_DITH4 Period **/
#define TCC0_PER_DITH4			MMIO32(TCC0_BASE + 0x40)
/** TCC0_PER_DITH5 Period **/
#define TCC0_PER_DITH5			MMIO32(TCC0_BASE + 0x40)
/** TCC0_PER_DITH6 Period **/
#define TCC0_PER_DITH6			MMIO32(TCC0_BASE + 0x40)
/** TCC0_CC0 Compare and Capture **/
#define TCC0_CC0			MMIO32(TCC0_BASE + 0x44)
/** TCC0_CC0_DITH4 Compare and Capture **/
#define TCC0_CC0_DITH4			MMIO32(TCC0_BASE + 0x44)
/** TCC0_CC0_DITH5 Compare and Capture **/
#define TCC0_CC0_DITH5			MMIO32(TCC0_BASE + 0x44)
/** TCC0_CC0_DITH6 Compare and Capture **/
#define TCC0_CC0_DITH6			MMIO32(TCC0_BASE + 0x44)
/** TCC0_CC1 Compare and Capture **/
#define TCC0_CC1			MMIO32(TCC0_BASE + 0x48)
/** TCC0_CC1_DITH4 Compare and Capture **/
#define TCC0_CC1_DITH4			MMIO32(TCC0_BASE + 0x48)
/** TCC0_CC1_DITH5 Compare and Capture **/
#define TCC0_CC1_DITH5			MMIO32(TCC0_BASE + 0x48)
/** TCC0_CC1_DITH6 Compare and Capture **/
#define TCC0_CC1_DITH6			MMIO32(TCC0_BASE + 0x48)
/** TCC0_CC2 Compare and Capture **/
#define TCC0_CC2			MMIO32(TCC0_BASE + 0x4c)
/** TCC0_CC2_DITH4 Compare and Capture **/
#define TCC0_CC2_DITH4			MMIO32(TCC0_BASE + 0x4c)
/** TCC0_CC2_DITH5 Compare and Capture **/
#define TCC0_CC2_DITH5			MMIO32(TCC0_BASE + 0x4c)
/** TCC0_CC2_DITH6 Compare and Capture **/
#define TCC0_CC2_DITH6			MMIO32(TCC0_BASE + 0x4c)
/** TCC0_CC3 Compare and Capture **/
#define TCC0_CC3			MMIO32(TCC0_BASE + 0x50)
/** TCC0_CC3_DITH4 Compare and Capture **/
#define TCC0_CC3_DITH4			MMIO32(TCC0_BASE + 0x50)
/** TCC0_CC3_DITH5 Compare and Capture **/
#define TCC0_CC3_DITH5			MMIO32(TCC0_BASE + 0x50)
/** TCC0_CC3_DITH6 Compare and Capture **/
#define TCC0_CC3_DITH6			MMIO32(TCC0_BASE + 0x50)
/** TCC0_PATTB Pattern Buffer **/
#define TCC0_PATTB			MMIO32(TCC0_BASE + 0x64)
/** TCC0_WAVEB Waveform Control Buffer **/
#define TCC0_WAVEB			MMIO32(TCC0_BASE + 0x68)
/** TCC0_PERB Period Buffer **/
#define TCC0_PERB			MMIO32(TCC0_BASE + 0x6c)
/** TCC0_PERB_DITH4 Period Buffer **/
#define TCC0_PERB_DITH4			MMIO32(TCC0_BASE + 0x6c)
/** TCC0_PERB_DITH5 Period Buffer **/
#define TCC0_PERB_DITH5			MMIO32(TCC0_BASE + 0x6c)
/** TCC0_PERB_DITH6 Period Buffer **/
#define TCC0_PERB_DITH6			MMIO32(TCC0_BASE + 0x6c)
/** TCC0_CCB0 Compare and Capture Buffer **/
#define TCC0_CCB0			MMIO32(TCC0_BASE + 0x70)
/** TCC0_CCB0_DITH4 Compare and Capture Buffer **/
#define TCC0_CCB0_DITH4			MMIO32(TCC0_BASE + 0x70)
/** TCC0_CCB0_DITH5 Compare and Capture Buffer **/
#define TCC0_CCB0_DITH5			MMIO32(TCC0_BASE + 0x70)
/** TCC0_CCB0_DITH6 Compare and Capture Buffer **/
#define TCC0_CCB0_DITH6			MMIO32(TCC0_BASE + 0x70)
/** TCC0_CCB1 Compare and Capture Buffer **/
#define TCC0_CCB1			MMIO32(TCC0_BASE + 0x74)
/** TCC0_CCB1_DITH4 Compare and Capture Buffer **/
#define TCC0_CCB1_DITH4			MMIO32(TCC0_BASE + 0x74)
/** TCC0_CCB1_DITH5 Compare and Capture Buffer **/
#define TCC0_CCB1_DITH5			MMIO32(TCC0_BASE + 0x74)
/** TCC0_CCB1_DITH6 Compare and Capture Buffer **/
#define TCC0_CCB1_DITH6			MMIO32(TCC0_BASE + 0x74)
/** TCC0_CCB2 Compare and Capture Buffer **/
#define TCC0_CCB2			MMIO32(TCC0_BASE + 0x78)
/** TCC0_CCB2_DITH4 Compare and Capture Buffer **/
#define TCC0_CCB2_DITH4			MMIO32(TCC0_BASE + 0x78)
/** TCC0_CCB2_DITH5 Compare and Capture Buffer **/
#define TCC0_CCB2_DITH5			MMIO32(TCC0_BASE + 0x78)
/** TCC0_CCB2_DITH6 Compare and Capture Buffer **/
#define TCC0_CCB2_DITH6			MMIO32(TCC0_BASE + 0x78)
/** TCC0_CCB3 Compare and Capture Buffer **/
#define TCC0_CCB3			MMIO32(TCC0_BASE + 0x7c)
/** TCC0_CCB3_DITH4 Compare and Capture Buffer **/
#define TCC0_CCB3_DITH4			MMIO32(TCC0_BASE + 0x7c)
/** TCC0_CCB3_DITH5 Compare and Capture Buffer **/
#define TCC0_CCB3_DITH5			MMIO32(TCC0_BASE + 0x7c)
/** TCC0_CCB3_DITH6 Compare and Capture Buffer **/
#define TCC0_CCB3_DITH6			MMIO32(TCC0_BASE + 0x7c)

/**@}*/


/** @defgroup tcc0_ctrla CTRLA Control A
@{*/

/** TCC0_CTRLA_CPTEN3 Capture Channel 3 Enable **/
#define TCC0_CTRLA_CPTEN3		(1 << 27)
/** TCC0_CTRLA_CPTEN2 Capture Channel 2 Enable **/
#define TCC0_CTRLA_CPTEN2		(1 << 26)
/** TCC0_CTRLA_CPTEN1 Capture Channel 1 Enable **/
#define TCC0_CTRLA_CPTEN1		(1 << 25)
/** TCC0_CTRLA_CPTEN0 Capture Channel 0 Enable **/
#define TCC0_CTRLA_CPTEN0		(1 << 24)
/** TCC0_CTRLA_ALOCK Auto Lock **/
#define TCC0_CTRLA_ALOCK		(1 << 14)

#define TCC0_CTRLA_PRESCSYNC_SHIFT		12
#define TCC0_CTRLA_PRESCSYNC_MASK		0x03
/** @defgroup tcc0_ctrla_prescsync PRESCSYNC Prescaler and Counter Synchronization Selection
@{*/
/**@}*/

