grevaillot/svd_tools/headers/ATSAMR21E19A/tcc0.h
#define TCC0_EVCTRL_EVACT1_SHIFT		3
#define TCC0_EVCTRL_EVACT1_MASK		0x07
/** @defgroup tcc0_evctrl_evact1 EVACT1 Timer/counter Input Event1 Action
@{*/
/**@}*/


#define TCC0_EVCTRL_EVACT0_SHIFT		0
#define TCC0_EVCTRL_EVACT0_MASK		0x07
/** @defgroup tcc0_evctrl_evact0 EVACT0 Timer/counter Input Event0 Action
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_intenclr INTENCLR Interrupt Enable Clear
@{*/

/** TCC0_INTENCLR_MC3 Match or Capture Channel 3 Interrupt Enable **/
#define TCC0_INTENCLR_MC3		(1 << 19)
/** TCC0_INTENCLR_MC2 Match or Capture Channel 2 Interrupt Enable **/
#define TCC0_INTENCLR_MC2		(1 << 18)
/** TCC0_INTENCLR_MC1 Match or Capture Channel 1 Interrupt Enable **/
#define TCC0_INTENCLR_MC1		(1 << 17)
/** TCC0_INTENCLR_MC0 Match or Capture Channel 0 Interrupt Enable **/
#define TCC0_INTENCLR_MC0		(1 << 16)
/** TCC0_INTENCLR_FAULT1 Non-Recoverable Fault 1 Interrupt Enable **/
#define TCC0_INTENCLR_FAULT1		(1 << 15)
/** TCC0_INTENCLR_FAULT0 Non-Recoverable Fault 0 Interrupt Enable **/
#define TCC0_INTENCLR_FAULT0		(1 << 14)
/** TCC0_INTENCLR_FAULTB Recoverable Fault B Interrupt Enable **/
#define TCC0_INTENCLR_FAULTB		(1 << 13)
/** TCC0_INTENCLR_FAULTA Recoverable Fault A Interrupt Enable **/
#define TCC0_INTENCLR_FAULTA		(1 << 12)
/** TCC0_INTENCLR_DFS Non-Recoverable Debug Fault Interrupt Enable **/
#define TCC0_INTENCLR_DFS		(1 << 11)
/** TCC0_INTENCLR_ERR Error Interrupt Enable **/
#define TCC0_INTENCLR_ERR		(1 << 3)
/** TCC0_INTENCLR_CNT Counter Interrupt Enable **/
#define TCC0_INTENCLR_CNT		(1 << 2)
/** TCC0_INTENCLR_TRG Retrigger Interrupt Enable **/
#define TCC0_INTENCLR_TRG		(1 << 1)
/** TCC0_INTENCLR_OVF Overflow Interrupt Enable **/
#define TCC0_INTENCLR_OVF		(1 << 0)

/**@}*/

/** @defgroup tcc0_intenset INTENSET Interrupt Enable Set
@{*/

/** TCC0_INTENSET_MC3 Match or Capture Channel 3 Interrupt Enable **/
#define TCC0_INTENSET_MC3		(1 << 19)
/** TCC0_INTENSET_MC2 Match or Capture Channel 2 Interrupt Enable **/
#define TCC0_INTENSET_MC2		(1 << 18)
/** TCC0_INTENSET_MC1 Match or Capture Channel 1 Interrupt Enable **/
#define TCC0_INTENSET_MC1		(1 << 17)
/** TCC0_INTENSET_MC0 Match or Capture Channel 0 Interrupt Enable **/
#define TCC0_INTENSET_MC0		(1 << 16)
/** TCC0_INTENSET_FAULT1 Non-Recoverable Fault 1 Interrupt Enable **/
#define TCC0_INTENSET_FAULT1		(1 << 15)
/** TCC0_INTENSET_FAULT0 Non-Recoverable Fault 0 Interrupt Enable **/
#define TCC0_INTENSET_FAULT0		(1 << 14)
/** TCC0_INTENSET_FAULTB Recoverable Fault B Interrupt Enable **/
#define TCC0_INTENSET_FAULTB		(1 << 13)
/** TCC0_INTENSET_FAULTA Recoverable Fault A Interrupt Enable **/
#define TCC0_INTENSET_FAULTA		(1 << 12)
/** TCC0_INTENSET_DFS Non-Recoverable Debug Fault Interrupt Enable **/
#define TCC0_INTENSET_DFS		(1 << 11)
/** TCC0_INTENSET_ERR Error Interrupt Enable **/
#define TCC0_INTENSET_ERR		(1 << 3)
/** TCC0_INTENSET_CNT Counter Interrupt Enable **/
#define TCC0_INTENSET_CNT		(1 << 2)
/** TCC0_INTENSET_TRG Retrigger Interrupt Enable **/
#define TCC0_INTENSET_TRG		(1 << 1)
/** TCC0_INTENSET_OVF Overflow Interrupt Enable **/
#define TCC0_INTENSET_OVF		(1 << 0)

/**@}*/

/** @defgroup tcc0_intflag INTFLAG Interrupt Flag Status and Clear
@{*/

/** TCC0_INTFLAG_MC3 Match or Capture 3 **/
#define TCC0_INTFLAG_MC3		(1 << 19)
/** TCC0_INTFLAG_MC2 Match or Capture 2 **/
#define TCC0_INTFLAG_MC2		(1 << 18)
/** TCC0_INTFLAG_MC1 Match or Capture 1 **/
#define TCC0_INTFLAG_MC1		(1 << 17)
/** TCC0_INTFLAG_MC0 Match or Capture 0 **/
#define TCC0_INTFLAG_MC0		(1 << 16)
/** TCC0_INTFLAG_FAULT1 Non-Recoverable Fault 1 **/
#define TCC0_INTFLAG_FAULT1		(1 << 15)
/** TCC0_INTFLAG_FAULT0 Non-Recoverable Fault 0 **/
#define TCC0_INTFLAG_FAULT0		(1 << 14)
/** TCC0_INTFLAG_FAULTB Recoverable Fault B **/
#define TCC0_INTFLAG_FAULTB		(1 << 13)
/** TCC0_INTFLAG_FAULTA Recoverable Fault A **/
#define TCC0_INTFLAG_FAULTA		(1 << 12)
/** TCC0_INTFLAG_DFS Non-Recoverable Debug Fault **/
#define TCC0_INTFLAG_DFS		(1 << 11)
/** TCC0_INTFLAG_ERR Error **/
#define TCC0_INTFLAG_ERR		(1 << 3)
/** TCC0_INTFLAG_CNT Counter **/
#define TCC0_INTFLAG_CNT		(1 << 2)
/** TCC0_INTFLAG_TRG Retrigger **/
#define TCC0_INTFLAG_TRG		(1 << 1)
/** TCC0_INTFLAG_OVF Overflow **/
#define TCC0_INTFLAG_OVF		(1 << 0)

/**@}*/

/** @defgroup tcc0_status STATUS Status
@{*/

/** TCC0_STATUS_CMP3 Compare Channel 3 Value **/
#define TCC0_STATUS_CMP3		(1 << 27)
/** TCC0_STATUS_CMP2 Compare Channel 2 Value **/
#define TCC0_STATUS_CMP2		(1 << 26)
/** TCC0_STATUS_CMP1 Compare Channel 1 Value **/
#define TCC0_STATUS_CMP1		(1 << 25)
/** TCC0_STATUS_CMP0 Compare Channel 0 Value **/
#define TCC0_STATUS_CMP0		(1 << 24)
/** TCC0_STATUS_CCBV3 Compare Channel 3 Buffer Valid **/
#define TCC0_STATUS_CCBV3		(1 << 19)
/** TCC0_STATUS_CCBV2 Compare Channel 2 Buffer Valid **/
#define TCC0_STATUS_CCBV2		(1 << 18)
/** TCC0_STATUS_CCBV1 Compare Channel 1 Buffer Valid **/
#define TCC0_STATUS_CCBV1		(1 << 17)
/** TCC0_STATUS_CCBV0 Compare Channel 0 Buffer Valid **/
#define TCC0_STATUS_CCBV0		(1 << 16)
/** TCC0_STATUS_FAULT1 Non-Recoverable Fault 1 State **/
#define TCC0_STATUS_FAULT1		(1 << 15)
/** TCC0_STATUS_FAULT0 Non-Recoverable Fault 0 State **/
#define TCC0_STATUS_FAULT0		(1 << 14)
/** TCC0_STATUS_FAULTB Recoverable Fault B State **/
#define TCC0_STATUS_FAULTB		(1 << 13)
/** TCC0_STATUS_FAULTA Recoverable Fault A State **/
#define TCC0_STATUS_FAULTA		(1 << 12)
/** TCC0_STATUS_FAULT1IN Non-Recoverable Fault1 Input **/
#define TCC0_STATUS_FAULT1IN		(1 << 11)
/** TCC0_STATUS_FAULT0IN Non-Recoverable Fault0 Input **/
#define TCC0_STATUS_FAULT0IN		(1 << 10)
/** TCC0_STATUS_FAULTBIN Recoverable Fault B Input **/
#define TCC0_STATUS_FAULTBIN		(1 << 9)
/** TCC0_STATUS_FAULTAIN Recoverable Fault A Input **/
#define TCC0_STATUS_FAULTAIN		(1 << 8)
/** TCC0_STATUS_PERBV Period Buffer Valid **/
#define TCC0_STATUS_PERBV		(1 << 7)
/** TCC0_STATUS_WAVEBV Wave Buffer Valid **/
#define TCC0_STATUS_WAVEBV		(1 << 6)
/** TCC0_STATUS_PATTBV Pattern Buffer Valid **/
#define TCC0_STATUS_PATTBV		(1 << 5)
/** TCC0_STATUS_SLAVE Slave **/
#define TCC0_STATUS_SLAVE		(1 << 4)
/** TCC0_STATUS_DFS Non-Recoverable Debug Fault State **/
#define TCC0_STATUS_DFS		(1 << 3)
/** TCC0_STATUS_IDX Ramp **/
#define TCC0_STATUS_IDX		(1 << 1)
/** TCC0_STATUS_STOP Stop **/
#define TCC0_STATUS_STOP		(1 << 0)

/**@}*/

/** @defgroup tcc0_count COUNT Count
@{*/


#define TCC0_COUNT_COUNT_SHIFT		0
#define TCC0_COUNT_COUNT_MASK		0xffffff
/** @defgroup tcc0_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

