grevaillot/svd_tools/headers/ATSAMR21E19A/tcc0.h
/** @defgroup tcc0_count_dith4 COUNTDITH4 Count
@{*/


#define TCC0_COUNT_DITH4_COUNT_SHIFT		4
#define TCC0_COUNT_DITH4_COUNT_MASK		0xfffff
/** @defgroup tcc0_count_dith4_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_count_dith5 COUNTDITH5 Count
@{*/


#define TCC0_COUNT_DITH5_COUNT_SHIFT		5
#define TCC0_COUNT_DITH5_COUNT_MASK		0x7ffff
/** @defgroup tcc0_count_dith5_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_count_dith6 COUNTDITH6 Count
@{*/


#define TCC0_COUNT_DITH6_COUNT_SHIFT		6
#define TCC0_COUNT_DITH6_COUNT_MASK		0x3ffff
/** @defgroup tcc0_count_dith6_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_patt PATT Pattern
@{*/

/** TCC0_PATT_PGV7 Pattern Generator 7 Output Value **/
#define TCC0_PATT_PGV7		(1 << 15)
/** TCC0_PATT_PGV6 Pattern Generator 6 Output Value **/
#define TCC0_PATT_PGV6		(1 << 14)
/** TCC0_PATT_PGV5 Pattern Generator 5 Output Value **/
#define TCC0_PATT_PGV5		(1 << 13)
/** TCC0_PATT_PGV4 Pattern Generator 4 Output Value **/
#define TCC0_PATT_PGV4		(1 << 12)
/** TCC0_PATT_PGV3 Pattern Generator 3 Output Value **/
#define TCC0_PATT_PGV3		(1 << 11)
/** TCC0_PATT_PGV2 Pattern Generator 2 Output Value **/
#define TCC0_PATT_PGV2		(1 << 10)
/** TCC0_PATT_PGV1 Pattern Generator 1 Output Value **/
#define TCC0_PATT_PGV1		(1 << 9)
/** TCC0_PATT_PGV0 Pattern Generator 0 Output Value **/
#define TCC0_PATT_PGV0		(1 << 8)
/** TCC0_PATT_PGE7 Pattern Generator 7 Output Enable **/
#define TCC0_PATT_PGE7		(1 << 7)
/** TCC0_PATT_PGE6 Pattern Generator 6 Output Enable **/
#define TCC0_PATT_PGE6		(1 << 6)
/** TCC0_PATT_PGE5 Pattern Generator 5 Output Enable **/
#define TCC0_PATT_PGE5		(1 << 5)
/** TCC0_PATT_PGE4 Pattern Generator 4 Output Enable **/
#define TCC0_PATT_PGE4		(1 << 4)
/** TCC0_PATT_PGE3 Pattern Generator 3 Output Enable **/
#define TCC0_PATT_PGE3		(1 << 3)
/** TCC0_PATT_PGE2 Pattern Generator 2 Output Enable **/
#define TCC0_PATT_PGE2		(1 << 2)
/** TCC0_PATT_PGE1 Pattern Generator 1 Output Enable **/
#define TCC0_PATT_PGE1		(1 << 1)
/** TCC0_PATT_PGE0 Pattern Generator 0 Output Enable **/
#define TCC0_PATT_PGE0		(1 << 0)

/**@}*/

/** @defgroup tcc0_wave WAVE Waveform Control
@{*/

/** TCC0_WAVE_SWAP3 Swap DTI Output Pair 3 **/
#define TCC0_WAVE_SWAP3		(1 << 27)
/** TCC0_WAVE_SWAP2 Swap DTI Output Pair 2 **/
#define TCC0_WAVE_SWAP2		(1 << 26)
/** TCC0_WAVE_SWAP1 Swap DTI Output Pair 1 **/
#define TCC0_WAVE_SWAP1		(1 << 25)
/** TCC0_WAVE_SWAP0 Swap DTI Output Pair 0 **/
#define TCC0_WAVE_SWAP0		(1 << 24)
/** TCC0_WAVE_POL3 Channel 3 Polarity **/
#define TCC0_WAVE_POL3		(1 << 19)
/** TCC0_WAVE_POL2 Channel 2 Polarity **/
#define TCC0_WAVE_POL2		(1 << 18)
/** TCC0_WAVE_POL1 Channel 1 Polarity **/
#define TCC0_WAVE_POL1		(1 << 17)
/** TCC0_WAVE_POL0 Channel 0 Polarity **/
#define TCC0_WAVE_POL0		(1 << 16)
/** TCC0_WAVE_CICCEN3 Circular Channel 3 Enable **/
#define TCC0_WAVE_CICCEN3		(1 << 11)
/** TCC0_WAVE_CICCEN2 Circular Channel 2 Enable **/
#define TCC0_WAVE_CICCEN2		(1 << 10)
/** TCC0_WAVE_CICCEN1 Circular Channel 1 Enable **/
#define TCC0_WAVE_CICCEN1		(1 << 9)
/** TCC0_WAVE_CICCEN0 Circular Channel 0 Enable **/
#define TCC0_WAVE_CICCEN0		(1 << 8)
/** TCC0_WAVE_CIPEREN Circular period Enable **/
#define TCC0_WAVE_CIPEREN		(1 << 7)

#define TCC0_WAVE_RAMP_SHIFT		4
#define TCC0_WAVE_RAMP_MASK		0x03
/** @defgroup tcc0_wave_ramp RAMP Ramp Mode
@{*/
/**@}*/


#define TCC0_WAVE_WAVEGEN_SHIFT		0
#define TCC0_WAVE_WAVEGEN_MASK		0x07
/** @defgroup tcc0_wave_wavegen WAVEGEN Waveform Generation
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_per PER Period
@{*/


#define TCC0_PER_PER_SHIFT		0
#define TCC0_PER_PER_MASK		0xffffff
/** @defgroup tcc0_per_per PER Period Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_per_dith4 PERDITH4 Period
@{*/


#define TCC0_PER_DITH4_PER_SHIFT		4
#define TCC0_PER_DITH4_PER_MASK		0xfffff
/** @defgroup tcc0_per_dith4_per PER Period Value
@{*/
/**@}*/


#define TCC0_PER_DITH4_DITHERCY_SHIFT		0
#define TCC0_PER_DITH4_DITHERCY_MASK		0x0f
/** @defgroup tcc0_per_dith4_dithercy DITHERCY Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_per_dith5 PERDITH5 Period
@{*/


#define TCC0_PER_DITH5_PER_SHIFT		5
#define TCC0_PER_DITH5_PER_MASK		0x7ffff
/** @defgroup tcc0_per_dith5_per PER Period Value
@{*/
/**@}*/


#define TCC0_PER_DITH5_DITHERCY_SHIFT		0
#define TCC0_PER_DITH5_DITHERCY_MASK		0x1f
/** @defgroup tcc0_per_dith5_dithercy DITHERCY Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_per_dith6 PERDITH6 Period
@{*/


#define TCC0_PER_DITH6_PER_SHIFT		6
#define TCC0_PER_DITH6_PER_MASK		0x3ffff
/** @defgroup tcc0_per_dith6_per PER Period Value
@{*/
/**@}*/


#define TCC0_PER_DITH6_DITHERCY_SHIFT		0
#define TCC0_PER_DITH6_DITHERCY_MASK		0x3f
/** @defgroup tcc0_per_dith6_dithercy DITHERCY Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc0 CC0 Compare and Capture
@{*/


#define TCC0_CC0_CC_SHIFT		0
#define TCC0_CC0_CC_MASK		0xffffff
/** @defgroup tcc0_cc0_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc0_dith4 CC0DITH4 Compare and Capture
@{*/


#define TCC0_CC0_DITH4_CC_SHIFT		4
#define TCC0_CC0_DITH4_CC_MASK		0xfffff
/** @defgroup tcc0_cc0_dith4_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC0_DITH4_DITHERCY_SHIFT		0
#define TCC0_CC0_DITH4_DITHERCY_MASK		0x0f
/** @defgroup tcc0_cc0_dith4_dithercy DITHERCY Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc0_dith5 CC0DITH5 Compare and Capture
@{*/


#define TCC0_CC0_DITH5_CC_SHIFT		5
#define TCC0_CC0_DITH5_CC_MASK		0x7ffff
/** @defgroup tcc0_cc0_dith5_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC0_DITH5_DITHERCY_SHIFT		0
#define TCC0_CC0_DITH5_DITHERCY_MASK		0x1f
/** @defgroup tcc0_cc0_dith5_dithercy DITHERCY Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc0_dith6 CC0DITH6 Compare and Capture
@{*/


#define TCC0_CC0_DITH6_CC_SHIFT		6
#define TCC0_CC0_DITH6_CC_MASK		0x3ffff
/** @defgroup tcc0_cc0_dith6_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


