grevaillot/svd_tools/headers/ATSAMR21E19A/tcc0.h
#define TCC0_WAVEB_RAMPB_SHIFT		4
#define TCC0_WAVEB_RAMPB_MASK		0x03
/** @defgroup tcc0_waveb_rampb RAMPB Ramp Mode Buffer
@{*/
/**@}*/


#define TCC0_WAVEB_WAVEGENB_SHIFT		0
#define TCC0_WAVEB_WAVEGENB_MASK		0x07
/** @defgroup tcc0_waveb_wavegenb WAVEGENB Waveform Generation Buffer
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_perb PERB Period Buffer
@{*/


#define TCC0_PERB_PERB_SHIFT		0
#define TCC0_PERB_PERB_MASK		0xffffff
/** @defgroup tcc0_perb_perb PERB Period Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_perb_dith4 PERBDITH4 Period Buffer
@{*/


#define TCC0_PERB_DITH4_PERB_SHIFT		4
#define TCC0_PERB_DITH4_PERB_MASK		0xfffff
/** @defgroup tcc0_perb_dith4_perb PERB Period Buffer Value
@{*/
/**@}*/


#define TCC0_PERB_DITH4_DITHERCYB_SHIFT		0
#define TCC0_PERB_DITH4_DITHERCYB_MASK		0x0f
/** @defgroup tcc0_perb_dith4_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_perb_dith5 PERBDITH5 Period Buffer
@{*/


#define TCC0_PERB_DITH5_PERB_SHIFT		5
#define TCC0_PERB_DITH5_PERB_MASK		0x7ffff
/** @defgroup tcc0_perb_dith5_perb PERB Period Buffer Value
@{*/
/**@}*/


#define TCC0_PERB_DITH5_DITHERCYB_SHIFT		0
#define TCC0_PERB_DITH5_DITHERCYB_MASK		0x1f
/** @defgroup tcc0_perb_dith5_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_perb_dith6 PERBDITH6 Period Buffer
@{*/


#define TCC0_PERB_DITH6_PERB_SHIFT		6
#define TCC0_PERB_DITH6_PERB_MASK		0x3ffff
/** @defgroup tcc0_perb_dith6_perb PERB Period Buffer Value
@{*/
/**@}*/


#define TCC0_PERB_DITH6_DITHERCYB_SHIFT		0
#define TCC0_PERB_DITH6_DITHERCYB_MASK		0x3f
/** @defgroup tcc0_perb_dith6_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb0 CCB0 Compare and Capture Buffer
@{*/


#define TCC0_CCB0_CCB_SHIFT		0
#define TCC0_CCB0_CCB_MASK		0xffffff
/** @defgroup tcc0_ccb0_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb0_dith4 CCB0DITH4 Compare and Capture Buffer
@{*/


#define TCC0_CCB0_DITH4_CCB_SHIFT		4
#define TCC0_CCB0_DITH4_CCB_MASK		0xfffff
/** @defgroup tcc0_ccb0_dith4_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB0_DITH4_DITHERCYB_SHIFT		0
#define TCC0_CCB0_DITH4_DITHERCYB_MASK		0x0f
/** @defgroup tcc0_ccb0_dith4_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb0_dith5 CCB0DITH5 Compare and Capture Buffer
@{*/


#define TCC0_CCB0_DITH5_CCB_SHIFT		5
#define TCC0_CCB0_DITH5_CCB_MASK		0x7ffff
/** @defgroup tcc0_ccb0_dith5_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB0_DITH5_DITHERCYB_SHIFT		0
#define TCC0_CCB0_DITH5_DITHERCYB_MASK		0x1f
/** @defgroup tcc0_ccb0_dith5_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb0_dith6 CCB0DITH6 Compare and Capture Buffer
@{*/


#define TCC0_CCB0_DITH6_CCB_SHIFT		6
#define TCC0_CCB0_DITH6_CCB_MASK		0x3ffff
/** @defgroup tcc0_ccb0_dith6_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB0_DITH6_DITHERCYB_SHIFT		0
#define TCC0_CCB0_DITH6_DITHERCYB_MASK		0x3f
/** @defgroup tcc0_ccb0_dith6_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb1 CCB1 Compare and Capture Buffer
@{*/


#define TCC0_CCB1_CCB_SHIFT		0
#define TCC0_CCB1_CCB_MASK		0xffffff
/** @defgroup tcc0_ccb1_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb1_dith4 CCB1DITH4 Compare and Capture Buffer
@{*/


#define TCC0_CCB1_DITH4_CCB_SHIFT		4
#define TCC0_CCB1_DITH4_CCB_MASK		0xfffff
/** @defgroup tcc0_ccb1_dith4_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB1_DITH4_DITHERCYB_SHIFT		0
#define TCC0_CCB1_DITH4_DITHERCYB_MASK		0x0f
/** @defgroup tcc0_ccb1_dith4_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb1_dith5 CCB1DITH5 Compare and Capture Buffer
@{*/


#define TCC0_CCB1_DITH5_CCB_SHIFT		5
#define TCC0_CCB1_DITH5_CCB_MASK		0x7ffff
/** @defgroup tcc0_ccb1_dith5_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB1_DITH5_DITHERCYB_SHIFT		0
#define TCC0_CCB1_DITH5_DITHERCYB_MASK		0x1f
/** @defgroup tcc0_ccb1_dith5_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb1_dith6 CCB1DITH6 Compare and Capture Buffer
@{*/


#define TCC0_CCB1_DITH6_CCB_SHIFT		6
#define TCC0_CCB1_DITH6_CCB_MASK		0x3ffff
/** @defgroup tcc0_ccb1_dith6_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB1_DITH6_DITHERCYB_SHIFT		0
#define TCC0_CCB1_DITH6_DITHERCYB_MASK		0x3f
/** @defgroup tcc0_ccb1_dith6_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb2 CCB2 Compare and Capture Buffer
@{*/


#define TCC0_CCB2_CCB_SHIFT		0
#define TCC0_CCB2_CCB_MASK		0xffffff
/** @defgroup tcc0_ccb2_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb2_dith4 CCB2DITH4 Compare and Capture Buffer
@{*/


#define TCC0_CCB2_DITH4_CCB_SHIFT		4
#define TCC0_CCB2_DITH4_CCB_MASK		0xfffff
/** @defgroup tcc0_ccb2_dith4_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB2_DITH4_DITHERCYB_SHIFT		0
#define TCC0_CCB2_DITH4_DITHERCYB_MASK		0x0f
/** @defgroup tcc0_ccb2_dith4_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb2_dith5 CCB2DITH5 Compare and Capture Buffer
@{*/


#define TCC0_CCB2_DITH5_CCB_SHIFT		5
#define TCC0_CCB2_DITH5_CCB_MASK		0x7ffff
/** @defgroup tcc0_ccb2_dith5_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB2_DITH5_DITHERCYB_SHIFT		0
#define TCC0_CCB2_DITH5_DITHERCYB_MASK		0x1f
/** @defgroup tcc0_ccb2_dith5_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb2_dith6 CCB2DITH6 Compare and Capture Buffer
@{*/


#define TCC0_CCB2_DITH6_CCB_SHIFT		6
#define TCC0_CCB2_DITH6_CCB_MASK		0x3ffff
/** @defgroup tcc0_ccb2_dith6_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


