grevaillot/svd_tools/headers/ATSAMR21E19A/tcc0.h
#define TCC0_CCB2_DITH6_DITHERCYB_SHIFT		0
#define TCC0_CCB2_DITH6_DITHERCYB_MASK		0x3f
/** @defgroup tcc0_ccb2_dith6_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb3 CCB3 Compare and Capture Buffer
@{*/


#define TCC0_CCB3_CCB_SHIFT		0
#define TCC0_CCB3_CCB_MASK		0xffffff
/** @defgroup tcc0_ccb3_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb3_dith4 CCB3DITH4 Compare and Capture Buffer
@{*/


#define TCC0_CCB3_DITH4_CCB_SHIFT		4
#define TCC0_CCB3_DITH4_CCB_MASK		0xfffff
/** @defgroup tcc0_ccb3_dith4_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB3_DITH4_DITHERCYB_SHIFT		0
#define TCC0_CCB3_DITH4_DITHERCYB_MASK		0x0f
/** @defgroup tcc0_ccb3_dith4_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb3_dith5 CCB3DITH5 Compare and Capture Buffer
@{*/


#define TCC0_CCB3_DITH5_CCB_SHIFT		5
#define TCC0_CCB3_DITH5_CCB_MASK		0x7ffff
/** @defgroup tcc0_ccb3_dith5_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB3_DITH5_DITHERCYB_SHIFT		0
#define TCC0_CCB3_DITH5_DITHERCYB_MASK		0x1f
/** @defgroup tcc0_ccb3_dith5_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_ccb3_dith6 CCB3DITH6 Compare and Capture Buffer
@{*/


#define TCC0_CCB3_DITH6_CCB_SHIFT		6
#define TCC0_CCB3_DITH6_CCB_MASK		0x3ffff
/** @defgroup tcc0_ccb3_dith6_ccb CCB Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC0_CCB3_DITH6_DITHERCYB_SHIFT		0
#define TCC0_CCB3_DITH6_DITHERCYB_MASK		0x3f
/** @defgroup tcc0_ccb3_dith6_dithercyb DITHERCYB Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/
